attribution_mapping = {
    "get_company_info_service": "\n请检查输入参数是否正确， get_company_info_service 传入的need_field 仅支持['公司名称', '公司简称', '英文名称', '关联证券', '公司代码', '曾用简称', '所属市场', '所属行业', '成立日期', '上市日期', '法人代表', '总经理’' '董秘’,''邮政编码', '注册地址', '办公地址', '联系电话', '传真’,''官方网址', '电子邮箱', '入选指数', '主营业务', '经营范围', '机构简介', '每股面值', '首发价格', '首发募资额', '首发主承商']",
    "get_company_info_service_by_abbreviation": "\n请检查输入参数是否正确， get_company_info_service_by_abbreviation 传入的need_field 仅支持['公司名称', '公司简称', '英文名称', '关联证券', '公司代码', '曾用简称', '所属市场', '所属行业', '成立日期', '上市日期', '法人代表', '总经理', '董秘', '邮政编码', '注册地址', '办公地址', '联系电话', '传真', '官方网址', '电子邮箱', '入选指数', '主营业务', '经营范围', '机构简介', '每股面值', '首发价格', '首发募资净额', '首发主承销商']",
    "get_company_info_service_by_code": "\n请检查输入参数是否正确， get_company_info_service_by_code 传入的need_field 仅支持['公司名称', '公司简称', '英文名称', '关联证券', '公司代码', '曾用简称', '所属市场', '所属行业', '成立日期', '上市日期', '法人代表', '总经理', '董秘', '邮政编码', '注册地址', '办公地址', '联系电话', '传真', '官方网址', '电子邮箱', '入选指数', '主营业务', '经营范围', '机构简介', '每股面值', '首发价格', '首发募资净额', '首发主承销商']",
    "get_company_register_service": "\n请检查输入参数是否正确， get_company_register_service 传入的need_field 仅支持['公司名称', '登记状态', '统一社会信用代码', '法定代表人', '注册资本', '成立日期', '企业地址', '联系电话', '联系邮箱', '注册号', '组织机构代码', '参保人数', '行业一级', '行业二级', '行业三级', '曾用名', '企业简介', '经营范围']",
    "get_company_name_by_uniform_social_code_service": "\n请检查输入参数是否正确， get_company_register_name_service 传入的need_field",
    "get_parent_company_info_service": "\n请检查输入参数是否正确,仅仅支持统一社会信用码",
    "get_listed_sub_company_info_service_by_parent_company_name": "\n请检查输入参数是否正确， get_listed_sub_company_info_service_by_parent_company_name 传入的need_field 仅支持['母公司全称', '母公司关系', '母公司参股比例', '母公司投资金额', '子公司名称']",
    "get_listed_all_sub_company_info_service_by_parent_company_name": "\n请检查输入参数是否正确， get_listed_all_sub_company_info_service_by_parent_company_name 传入的need_field 仅支持['母公司全称', '母公司关系', '母公司参股比例', '母公司投资金额', '全资子公司名称']",
    "get_legal_document_service": "\n请检查输入参数是否正确， get_legal_document_service 传入的need_field 仅支持['关联公司', '标题', '案号', '文书类型', '原告', '被告', '原告律师事务所', '被告律师事务所', '案由', '涉案金额', '判决结果', '日期', '文件名']",
    "get_company_involved_cases_info": "\n请检查输入参数是否正确， get_company_involved_cases_info 传入的need_field 仅支持['关联公司', '标题', '案号', '文书类型', '原告', '被告', '原告律师事务所', '被告律师事务所', '案由', '涉案金额', '判决结果', '日期', '文件名']",
    "get_court_info_service": "\n请检查输入参数是否正确， get_court_info 传入的need_field 仅支持['法院名称', '法院负责人', '成立日期', '法院地址', '法院联系电话', '法院官网']",
    "get_court_code_service": "\n请检查输入参数是否正确， get_court_code 传入的need_field 仅支持['法院名称', '行政级别', '法院级别', '法院代字', '区划代码', '级别']",
    "get_lawfirm_info_service": "\n请检查输入参数是否正确， get_lawfirm_info_service 传入的need_field 仅支持['律师事务所名称', '律师事务所唯一编码', '律师事务所负责人', '事务所注册资本', '事务所成立日期', '律师事务所地址', '通讯电话', '通讯邮箱', '律所登记机关']",
    "get_lawfirm_business_service": "\n请检查输入参数是否正确， get_lawfirm_business_service 传入的need_field 仅支持['律师事务所名称', '业务量排名', '服务已上市公司', '报告期间所服务上市公司违规事件', '报告期所服务上市公司接受立案调查']",
    "get_address_info_service": "\n请检查输入参数是否正确， get_address_info_service 传入的need_field 仅支持['地址', '省份', '城市', '区县']",
    "get_address_code_service": "\n请检查输入参数是否正确， get_address_code_service 传入的need_field 仅支持['省份', '城市', '城市区划代码', '区县', '区县区划代码']",
    "get_temp_info_service": "\n请检查输入参数是否正确， get_temp_info_service 传入的need_field 仅支持['日期', '省份', '城市', '天气', '最高温度', '最低温度', '湿度']",
    "get_legal_abstract_by_reference_service": "\n请检查输入参数是否正确， get_legal_abstract_service 传入的need_field 仅支持['文件名', '案号', '文本摘要']",
    "get_xzgxf_info_by_reference_service": "\n请检查输入参数是否正确， get_xzgxf_info_by_reference_service 传入的need_field 仅支持['限制高消费企业名称', '案号', '法定代表人', '申请人', '涉案金额', '执行法院', '立案日期', '限高发布日期']",
    "get_company_xzgxf_by_company_name_service": "\n请检查输入参数是否正确， get_company_xzgxf_by_company_name_service 传入的need_field 仅支持['限制高消费企业名称', '案号', '法定代表人', '申请人', '涉案金额', '执行法院', '立案日期', '限高发布日期']",
}

COMPANY_CORRECTION_INFO = '''工具调用错误，请仔细检查以下几点：
1. 公司名拼写错误：  纠正:{"温洲"} -> {"温州"}
2. 公司名重复错误：纠正:{"龙龙元建设[mask]"} -> {"龙元建设[mask]"} 
3. 公司名漏写错误: 纠正:{"[mask]集团有限公司"} -> {"[mask]集团股份有限公司"} 
4. 工具调用错误，仔细检查工具调用是否符合工具用法说明，请正确调用工具。
注意以下一些常见的错误工具调用：
(1) 公司基本信息和公司工商信息之间的相互错误使用
(2) (**重点错误**)当公司统一社会信用代码查询不到时请使用公司代码get_company_info_service_by_code查询，当代码位数小于18位时，请检查是否位公司代码重复情况如：330011443322->301432
(2) (**重点错误**)请确认问题中需要查询的公司是子公司还是母公司。
(3) (**重点错误**)错将公司简称/公司代码(股票代码)/当作公司名称,很多接口要求使用公司全称, 可以使用get_company_info_service_by_abbreviation等根据简称查公司全称。
'''

REFERENCE_CORRECTION_INFO = '''工具调用错误，请仔细检查以下几点：
案号规范： ("＋收案年度＋"＋ 法院代字＋ 类型代字＋案件编号＋“号”如：(2024)京01民再36号
1. 案号拼写错误：纠正:{"(2020)穷[mask]"} -> {"(2020)琼[mask]"}
2. 案号重复错误：纠正: {"(2020)苏01民民终终[mask]"} -> {"(2020)苏01民终[mask]"} 
3.案号漏写错误：纠正: {"2019苏[mask]"} -> {"(2019)苏[mask]"} 
4. 工具调用错误，仔细检查工具调用是否符合工具用法说明，请正确调用工具。
注意以下一些常见的错误工具调用：
(1) 问题中无明显案号，正确案号需要通过问题中的年份、法院代字(可以先根据案号查法院名称，再从法院名称查法院代字)和案件信息得到
(2) (**重点错误**)请使用get_court_code_service_by_reference根据案号返回审理法院名称。
(3) (**重点错误**)检索原告/被告是某公司的案件情况时，请使用get_company_involved_cases_info工具。
'''

COURT_CORRECTION_INFO = '''工具调用错误，请仔细检查以下几点：
基层法院法院名称规范: XX省XX县（市、区）XX法院 
其他法院类别命名规范: XX省(XX市，直辖市)X级法院
1. 法院名称拼写错误：纠正: {"福建省章洲市[mask]"} -> {"福建省漳州市[mask]"} 
2. 法院名称重复错误： 纠正:{"[mask]高级人人民民法院"} -> {"[mask]高级人民法院"} 
3.法院名称漏写错误：纠正:{"福建章洲mask]"} -> {"福建省漳州市[mask]"} 
4. 工具调用错误，仔细检查工具调用是否符合工具用法说明，请正确调用工具。
5. 人民法院分为四级，分别为基层人民法院、中级人民法院、高级人民法院和最高人民法院。基层法院名称为县（市、区）人民法院，而不出现基层字样。
注意以下一些常见的错误工具调用：
(1)get_court_info_service和get_court_code_service错误使用
(2)(**重点错误**)在想要得到法院的地址所在区县时，请使用法院地址(精确到街道号)而不是法院名称查询'''

ADDRESS_CORRECTION_INFO = '''工具调用错误，请仔细检查以下几点：
1. 区县信息拼写错误：纠正:{"廣東鹏鼎[mask]"} -> {"广东鹏鼎[mask]"} 
2. 区县信息多余/重复错误： 纠正:{"合肥市[mask]"} -> {"合肥[mask]"} 
3. 区县信息漏写错误：纠正: {"北京[mask]"} -> {"北京市[mask]"} 
4. 工具调用错误，仔细检查工具调用是否符合工具用法说明，请正确调用工具。
注意以下一些常见的错误工具调用：
(1) get_address_info_service仅仅接受精确到街道号的地址信息，不能接受公司名称，法院名称，律所名称等模糊信息。
(2) get_address_code_service参数省份、城市、区县不能简写或者省略，请严格使用书面语如:北京->北京市，新疆->新疆维吾尔自治区。
(3) get_address_code_service参数省份、城市、区县都要输入，请提前使用get_address_info_service获取省份、城市、区县信息。
(4) get_temp_info_service仅接受日期格式为YY年MM月DD日,省份和城市必须全部输入，不接受区县，请提前使用get_address_info_service获取省份、城市信息。
(5) (**重点错误**)使用地址工具时，请先获取到精确到街道号的地址信息(可以用get_company_info_service get_court_info_service get_lawfirm_info_service获取)后再利用get_address_info_service获取省份、城市、区县信息'''

DEFAULT_CORRECTION_INFO = '''工具调用错误，请仔细检查以下几点：
1. 拼写错误： 纠正: {"[mask]闽行区"} -> {"[mask]闵行区"} 
2. 重复错误： 纠正:{"河河南南良承[mask]"} -> {"河南良承[mask]"} 
3.漏写错误：纠正:{"北京[mask]"} -> {"北京市[mask]"} 
4. 工具调用错误，仔细检查工具调用是否符合工具用法说明，请正确调用工具。'''

DEFAULT_UNUSEFUL_INFO = [
    "公司名称", "公司简称", "英文名称", "关联证券", "公司代码", "曾用简称", "所属市场","涉案",
    "所属行业", "成立日期", "上市日期", "法人代表", "总经理", "董秘", "邮政编码",
    "注册地址", "办公地址", "联系电话", "传真", "官方网站", "电子邮箱", "入选指数",
    "主营业务", "经营范围", "机构简介", "每股面值", "首发价格", "首发募资净额",
    "首发主承销商", "登记状态", "统一社会信用代码", "注册资本", "企业地址",
    "联系邮箱", "注册号", "组织机构代码", "参保人数", "行业一级", "行业二级",
    "行业三级", "曾用名", "企业简介", "律师事务所名称", "业务量排名",
    "服务已上市公司", "报告期间所服务上市公司违规事件", "报告期所服务上市公司接受立案调查",
    "地址", "省份", "城市", "区县", "城市区划代码", "区县区划代码", "日期",
    "天气", "最高温度", "最低温度", "湿度", "文件名", "案号", "文本摘要",
    "限制高消费企业名称", "申请人", "涉案金额", "执行法院", "立案日期", "限高发布日期","关联公司","子公司",
    "上市公司","法院","已上市公司","公司","律师事务所","审理法院","基层法院","服务的上市公司","母公司","投资的公司","原告律师事务所",
    "全资子公司","原告方公司","原告律师事务所","区县级人民法院","高级人民法院","被告律师事务所","限高执行法院","被限高公司","案件审理法院",
    "中级人民法院","裁判文书案号","聘用律师事务所","原告律师","圈资公司","原告事务所","股票代码","法院名称","案件","涉诉文书","公司全称","限制高消费",
    "代字","涉案次数","原告","被告","所在地区","次数","法院地址","法院代字","法院层级","法院层级名称","法院层级代码","法院层级名称","法院层级代码","法院层级名称","法院层级代码",
    "股票简称"
]


ENTITY_COL_INFO = [
    "公司名称", "公司简称", "公司代码", "关联上市公司全称", "公司代码","统一社会信用代码", "关联公司", "地址","案号","原告律师事务所","被告律师事务所","法院名称","法院地址",
    "法院代字","律师事务所名称","律师事务所地址","限制高消费企业名称","执行法院","母公司全称","子公司名称"]

LISTED_ENTITY_COL_INFO = [
    '子公司名称','母公司参股比例','母公司投资金额','案号','案由','涉案金额','受理费',
    '限制高消费企业名称','全资子公司名称','关联公司',
]



correction_mapping = {
    "company": COMPANY_CORRECTION_INFO,
    "court": COURT_CORRECTION_INFO,
    "reference": REFERENCE_CORRECTION_INFO,
    "address": ADDRESS_CORRECTION_INFO,
    "default": DEFAULT_CORRECTION_INFO
}


simplied_tool_info = '''1. get_listed_company_info_service((优先使用)根据上市公司名称，获得该上市公司对应的基本信息, 包括公司代码(股票代码),主营业务,法人代表等 (常用),，可以用他来判断是否为上市公司,返回为空不为上市公司。
若上市公司查询不到信息如注册地址，办公地址等，请使用get_company_register_service.
强烈注意: 本工具不能查询公司的注册资本，注册资本查询请使用get_company_register_service.
参数:
company_name -- 公司名称，例如: 上海妙可蓝多食品科技股份有限公司 注意:仅仅接收公司全称，不接受公司代码，统一社会信用代码。

返回结果数量: 1条
返回字段名称： ['公司名称', '公司简称', '英文名称', '关联证券', '公司代码', '曾用简称', '所属市场', '所属行业', '成立日期', '上市日期', '法人代表', '总经理’' '董秘’,''邮政编码', '注册地址', '办公地址', '联系电话', '传真’,''官方网址', '电子邮箱', '入选指数', '主营业务', '经营范围', '机构简介', '每股面值', '首发价格', '首发募资净额', '首发主承商'])
2. get_company_info_service_by_abbreviation(根据公司简称，获得该公司对应的公司全称。

参数:
company_abbreviation -- 公司简称，例如: 金迪克

返回结果数量：1条
返回字段名称：['公司简称','公司名称'])
3. get_company_info_service_by_code(根据公司代码(公司股票代码)，获得该公司对应的公司全称 公司代码6位或者7位
参数:
company_code -- 公司代码，例如: 300682

返回结果数量：1条
返回字段名称：['公司代码','公司名称']。)
4. get_company_register_service(本工具查询公司的工商信息，注册资本请使用本工具查, 子母公司查询时常用来补充注册资本等信息。

company_name -- 公司名称，例如"上海妙可蓝多食品科技股份有限公司" 注意:仅仅接收公司全称，不接受公司代码，统一社会信用代码。


返回结果数量：1条
返回字段名称：['公司名称', '登记状态', '统一社会信用代码', '法定代表人', '注册资本', '成立日期', '企业地址', '联系电话', '联系邮箱', '注册号', '组织机构代码', '参保人数', '行业一级', '行业二级', '行业三级', '曾用名', '企业简介', '经营范围']。)
5. get_company_name_by_uniform_social_code_service(根据公司的统一社会信用代码查询公司名称，统一社会信用代码为18位字符串。

参数:
Uniform_social_redit_code -- 统一社会信用代码，例如： 913305007490121183

返回结果数量：1条
返回字段名称：['统一社会信用代码','公司名称']。)
6. get_parent_company_info_by_child_company_name_service(根据被投资的子公司名称获得投资该公司的母公司名称、投资比例、投资金额等信息。

参数:
sub_company_name -- 被投资的子公司全称，例如: 上海爱斯达克汽车空调系统有限公司 注意:仅仅接收公司全称，不接受公司代码，统一社会信用代码。

返回结果数量：1条
返回字段名称：['母公司全称', '母公司参股比例', '母公司投资金额', '子公司名称']。)
7. get_listed_sub_company_info_service_by_parent_company_name(根据母公司的名称查询该公司投资的所有子公司信息列表, 注意要查子公司的基本信息或者注册信息，请接着结合get_listed_company_info_service, get_registered_company_info_service使用。

当涉及整个成报告问题时，请把need_fields传入空列表[],表示返回全部字段。
参数:
parent_company_name -- 母公司全称，例如"天能电池集团股份有限公司" 注意:仅仅接收公司全称，不接受公司代码，统一社会信用代码。

返回结果数量：多条
返回字段名称：['母公司全称', '母公司关系', '母公司参股比例', '母公司投资金额', '子公司名称'])
8. get_listed_all_sub_company_info_service_by_parent_company_name(根据母公司的名称查询该公司投资的所有全资子公司信息列表，注意要查子公司的基本信息或者注册信息，请接着结合get_listed_company_info_service, get_registered_company_info_service使用。

当涉及整个成报告问题时，请把need_fields传入空列表[],表示返回全部字段。
参数:
parent_company_name -- 母公司全称，例如"天能电池集团股份有限公司" 注意:仅仅接收公司全称，不接受公司代码，统一社会信用代码。

返回结果数量：多条
返回字段名称：['母公司全称', '母公司关系', '母公司参股比例', '母公司投资金额', '全资子公司名称'])
9. get_legal_document_service(根据案号查询该案件的裁判文书相关信息，要查询案件的审理法院信息可以使用get_court_name_service_by_reference获取法院名称后再利用get_court_info_service获取法院信息.
同理要查询案件的被告，原告信息请使用get_listed_company_service_by_reference获取上市公司信息或者使用get_company_info_service获取公司信息.
同理要查询案件的被告律师事务所，原告律师事务所信息请使用get_law_firm_info_service获取律师事务所信息.


参数:
reference -- 案号，例如: (2019)沪0115民初61975号

返回结果数量：1条
返回字段名称：['关联公司', '标题', '案号', '年份', '文书类型', '原告', '被告', '原告律师事务所', '被告律师事务所', '案由','受理费','涉案金额', '判决结果', '日期', '文件名'])
10. get_company_involved_cases_info_service(根据关联涉案公司和筛选条件查询它所有的涉及案件信息。
根据案号查询该案件的裁判文书相关信息，要查询案件的审理法院信息可以使用get_court_name_service_by_reference获取法院名称后再利用get_court_info_service获取法院信息.
同理要查询案件的被告，原告信息请使用get_listed_company_service_by_reference获取上市公司信息或者使用get_company_info_service获取公司信息.
同理要查询案件的被告律师事务所，原告律师事务所信息请使用get_law_firm_info_service获取律师事务所信息.

当涉及整个成报告问题时，请把need_fields传入空列表[],表示返回全部字段。
当要筛选民事初审案件时，案件所对应的标题应该含有"一审民事"字样，,请自行筛选 ，其他同理筛选格式为X审(诉讼类型)。
当要筛选原告/被告是XX的案件时，请注意不要使用等于，而是使用包含，即使用.contains(XX)函数，请自行筛选。

参数:
company_name -- 关联涉案公司，例如"上海爱斯达克汽车空调系统有限公司"  注意:仅仅接收公司全称，不接受公司代码，统一社会信用代码。
need_fields -- 需要返回的字段列表，仅接受空列表[]或者其他字段列表例如[关联公司, 案号,原告,被告,原告律师事务所,被告律师事务所,案由,涉案金额,日期],need_fields传入空，则表示返回所有字段，否则返回填入的字段

返回结果数量：多条
返回字段名称：['关联公司', '标题', '案号', '年份', '文书类型', '原告', '被告', '原告律师事务所', '被告律师事务所', '案由', '受理费', '涉案金额', '判决结果', '日期', '文件名'])
11. get_court_info_service(根据法院名称查询法院地理位置和负责人等相关信息。

参数:
court_name -- 法院名称，例如"上海市浦东新区人民法院", 不允许输入法院代号

返回结果数量：1条
返回字段名称：['法院名称', '法院负责人', '成立日期', '法院地址', '法院联系电话', '法院官网'])
12. get_court_code_service(根据法院名称或者法院代字查询法院级别和代号等相关数据。
案号规范：(收案年度) ＋ 法院代字＋ 类型代字＋案件编号＋“号”如：(2024)京01民再36号
参数:
court_name -- 法院名称或者法院代字，例如"上海市浦东新区人民法院"或者"沪0115"

返回结果数量：1条
返回字段名称：['法院名称', '行政级别', '法院级别', '法院代字', '区划代码', '级别'])
13. get_lawfirm_info_service(根据律师事务所名称查询律师事务所人事，地理位置，注册金额等信息。
参数:
law_firm_name -- 律师事务所名称，例如"北京市金杜律师事务所"

返回结果数量：1条
返回字段名称：['律师事务所名称', '律师事务所唯一编码', '律师事务所负责人', '事务所注册资本', '律师事务所成立日期', '律师事务所地址', '通讯电话', '通讯邮箱', '律所登记机关'])
14. get_lawfirm_business_service(根据律师事务所名称查询律师事务所业务情况统计数据。

参数:
law_firm_name -- 律师事务所名称，例如"北京市金杜律师事务所"

返回结果数量：1条
返回字段名称：['律师事务所名称', '业务量排名', '服务已上市公司', '报告期间所服务上市公司违规事件', '报告期所服务上市公司接受立案调查'])
15. get_address_info_service(根据地址查该地址对应的省份城市区县，地址信息仅接受精确到街道房屋号等信息如 上海市浦东新区丁香路611号 ，不接受公司名称，不接受法院名称，不接受律所名称等模糊查询。

参数:
address -- 地址，例如"西藏自治区那曲地区安多县帕那镇中路13号"

返回结果数量：1条
返回字段名称：['地址', '省份', '城市', '区县'])
16. get_address_code_service(根据省市区查询区划代码，注意省份，城市，区县必须全部输入,注意若是直辖市则省份城市都需要传入直辖市名称。

参数:
province -- 省份，例如"西藏自治区"
city -- 城市，例如"拉萨市"
county -- 区县，例如"城关区"

返回结果数量：1条
返回字段名称：['省份', '城市', '城市区划代码', '区县', '区县区划代码'])
17. get_temp_info_service(根据日期及省份城市查询天气相关信息，注意若是直辖市则省份城市都需要传入直辖市名称，仅接受日期格式为YYYY年MM月DD日 如：2020年1月23日]，注意日为10以下无需加0如 2024年8月5日。
日期可通过如下函数完成转换环境内置函数format_date(直接调用)完成:
date = format_date("2020-11-06 00:00:00") 
即: 2020-11-06 00:00:00 --> 2020年11月6日
2020年11月6日

参数:
province -- 省份，例如"北京市"
city -- 城市，例如"北京市"
date -- 日期，例如"2020年1月1日"

返回结果数量：1条
返回字段名称：['日期', '省份', '城市', '天气', '最高温度', '最低温度', '湿度'])
18. get_legal_abstract_by_reference_service(根据案号查询文本摘要，返回内容：['文件名', '案号', '文本摘要']。

参数:
reference -- 案号，例如"（2019）沪0115民初61975号"

返回结果数量：1条
返回字段名称：['文件名', '案号', '文本摘要'])
19. get_xzgxf_info_by_reference_service(根据案号查询限制高消费案件相关信息。

参数:
reference -- 案号，例如"（2018）鲁0403执1281号"

返回结果数量：1条
返回字段名称：['限制高消费企业名称', '案号', '法定代表人', '申请人', '涉案金额', '执行法院', '立案日期', '限高发布日期'])
20. get_company_xzgxf_by_company_name_service(根据公司名称查询它所有涉及限制高消费案件相关信息，返回内容。
注意：每调用一次该函数，返回的结果一定要保存, 当涉及整个成报告问题时，请把need_fields传入空列表[],表示返回全部字段。

参数:
company_name -- 公司名称，例如"欣水源生态环境科技有限公司"  注意:仅仅接收公司全称，不接受公司代码，统一社会信用代码。
need_fields -- 需要返回的字段列表，仅接受空列表[]或者其他字段列表 例如[限制高消费企业名称,案号,法定代表人,申请人,涉案金额, 立案日期],need_fields传入，则表示返回所有字段，否则返回填入的字段

返回结果数量：多条
返回字段名称：['限制高消费企业名称', '年份', '案号', '法定代表人', '申请人', '涉案金额', '执行法院', '立案日期', '限高发布日期'])
21. get_court_name_service_by_reference(根据案号返回审理法院名称。

参数:
reference -- 案号 例如: 

返回结果数量：1
返回字段名称：['案号','审理法院名称'])
22. get_sue_base_info_serivce(根据民事起诉状的问题提取问题中提到的所有有关字段

参数:
question -- 问题 例如: 

返回结果数量: 1
返回字段名称: ['起诉状'])
23. get_sue_serivce(根据诉讼信息返回民事起诉状(公民起诉公司)的所有字段, sue_info 要求的字段: ['原告', .....] 

参数:
sue_info -- 诉讼信息 例如: 

返回结果数量: 1条
返回字段名称: ['起诉状'])
24. save_all_company_info_to_doc_service(根据公司名称，和该公司的工商信息，(全资)子公司信息，涉案信息，限制高消费信息整合成报告，记住上述四种信息都要查询，利用下述工具,get_company_register_service
,get_listed_sub_company_info_service_by_parent_company_name/get_listed_all_sub_company_info_service_by_parent_company_name, get_company_involved_cases_info_service, get_company_xzgxf_by_company_name_service获取对应数据信息路径。


参数:
company_name -- 公司名称，例如"（2018）鲁0403执1281号"
company_register_info_path -- 公司工商信息保存路径，例如"XXX_get_company_register_service.csv"
company_subcompany_info_path -- 公司子公司信息保存路径，例如"XXX_get_listed_sub_company_info_service_by_parent_company_name/get_listed_sub_company_info_service_by_company_name.csv"
company_involved_cases_info -- 公司涉案信息保存路径，例如"XXXX_get_company_involved_cases_info_service.csv"
company_xzgxf_info -- 公司限制高消费信息保存路径，例如"XXXX_get_company_xzgxf_by_company_name_service.csv"


返回结果数量：1条
返回字段名称：['公司名称','整合报告信息'])
'''