import json

TABLES = [
    {
        "表名": "CompanyInfo",
        "属性值": [
            "公司名称", "公司简称", "英文名称", "关联证券", "公司代码", "曾用简称", "所属市场", "所属行业", "成立日期",
            "上市日期", "法人代表", "总经理", "董秘", "邮政编码",
            "注册地址", "办公地址", "联系电话", "传真", "官方网址", "电子邮箱", "入选指数", "主营业务", "经营范围",
            "机构简介", "每股面值", "首发价格", "首发募资净额",
            "首发主承销商"
        ],
    },
    {
        "表名": "CompanyRegister",
        "属性值": [
            "公司名称", "登记状态", "统一社会信用代码", "法定代表人", "注册资本", "成立日期", "企业地址", "联系电话",
            "联系邮箱", "注册号", "组织机构代码", "参保人数",
            "行业一级", "行业二级", "行业三级", "曾用名", "企业简介", "经营范围"
        ],
    },
    {
        "表名": "SubCompanyInfo",
        "属性值": [
            "关联上市公司全称", "上市公司关系", "上市公司参股比例", "上市公司投资金额", "公司名称"
        ],
    },
    {
        "表名": "LegalDoc",
        "属性值": [
            "关联公司", "标题", "案号", "文书类型", "原告", "被告", "原告律师事务所", "被告律师事务所", "案由",
            "涉案金额", "判决结果", "日期", "文件名"
        ],
    },
    {
        "表名": "CourtInfo",
        "属性值": [
            "法院名称", "法院负责人", "成立日期", "法院地址", "法院联系电话", "法院官网"
        ],
    },
    {
        "表名": "CourtCode",
        "属性值": [
            "法院名称", "行政级别", "法院级别", "法院代字", "区划代码", "级别"
        ],
    },
    {
        "表名": "LawfirmInfo",
        "属性值": [
            "律师事务所名称", "律师事务所唯一编码", "律师事务所负责人", "事务所注册资本", "事务所成立日期",
            "律师事务所地址", "通讯电话", "通讯邮箱", "律所登记机关"
        ],
    },
    {
        "表名": "LawfirmLog",
        "属性值": [
            "律师事务所名称", "业务量排名", "服务已上市公司", "报告期间所服务上市公司违规事件", "报告期所服务上市公司接受立案调查"
        ],
    },
    {
        "表名": "AddrInfo",
        "属性值": [
            "地址", "省份", "城市", "区县"
        ],
    },
    {
        "表名": "AddrCode",
        "属性值": [
            "省份", "城市", "城市区划代码", "区县", "区县区划代码"
        ]
    },
    {
        "表名": "TempInfo",
        "属性值": [
            "日期", "省份", "城市", "天气", "最高温度", "最低温度", "湿度"
        ],

    },
    {
        "表名": "LegalAbstract",
        "属性值": [
            "文件名", "案号", "文本摘要"
        ],

    },
    {
        "表名": "XzgxfInfo",
        "属性值": [
            "限制高消费企业名称", "案号", "法定代表人", "申请人", "涉案金额", "执行法院", "立案日期", "限高发布日期"
        ],

    },
]

APIS = [{'路由': '/get_company_info', '数据表': 'CompanyInfo',
         'API描述': '根据上市公司名称、简称或代码查找CompanyInfo表中的上市公司信息',
         '输入参数': {'query_conds': {'公司名称|公司简称|公司代码': 'str'}, 'need_fields': ['CompanyInfo属性值']},
         '参数示例': {'query_conds': {'公司名称': '上海妙可蓝多食品科技股份有限公司'}, 'need_fields': []},
         '返回值示例': {'公司名称': '上海妙可蓝多食品科技股份有限公司', '公司简称': '妙可蓝多',
                        '英文名称': 'Shanghai Milkground Food Tech Co., Ltd.',
                        '关联证券': '', '公司代码': '600882', '曾用简称': '大成股份>> *ST大成>> 华联矿业>> 广泽股份',
                        '所属市场': '上交所', '所属行业': '食品制造业',
                        '成立日期': '1988-11-29', '上市日期': '1995-12-06', '法人代表': '柴琇', '总经理': '柴琇',
                        '董秘': '谢毅', '邮政编码': '200136',
                        '注册地址': '上海市奉贤区工业路899号8幢', '办公地址': '上海市浦东新区金桥路1398号金台大厦10楼',
                        '联系电话': '021-50188700',
                        '传真': '021-50188918', '官方网址': 'www.milkground.cn', '电子邮箱': 'ir@milkland.com.cn',
                        '入选指数': '国证Ａ指,巨潮小盘',
                        '主营业务': '以奶酪、液态奶为核心的特色乳制品的研发、生产和销售，同时公司也从事以奶粉、黄油为主的乳制品贸易业务。',
                        '经营范围': '经营范围描述',
                        '机构简介': '公司简介(营业执照:16410234)。',
                        '每股面值': '1.0', '首发价格': '1.0', '首发募资净额': '4950.0', '首发主承销商': ''},
         '作用': '查询指定上市公司的详细信息，包括CompanyInfo里的所有信息',
         '备注': '必须是上市公司名称、简称或代码，其中query_conds的key可以是公司名称 公司简称  公司代码'},
        {'路由': '/get_company_register_name', '数据表': 'CompanyRegister',
         'API描述': '根据统一社会信用代码查询公司名称',
         '输入参数': {'query_conds': {'统一社会信用代码': 'str'}, 'need_fields': ['CompanyRegister属性值']},
         '参数示例': {'query_conds': {'统一社会信用代码': '913305007490121183'}, 'need_fields': []},
         '返回值示例': {'公司名称': '天能电池集团股份有限公司'}, '作用': '通过统一社会信用代码查询公司名称',
         '备注': '必须是统一社会信用代码'},
        {'路由': '/get_company_register', '数据表': 'CompanyRegister',
         'API描述': '根据公司名称，查询工商信息，注意/get_company_register接口无法根据统一社会信用代码查询公司名称',
         '输入参数': {'query_conds': {'公司名称': 'str'}, 'need_fields': ['CompanyRegister属性值']},
         '参数示例': {'query_conds': {'公司名称': '天能电池集团股份有限公司'}, 'need_fields': []},
         '返回值示例': {'公司名称': '天能电池集团股份有限公司', '登记状态': '存续',
                        '统一社会信用代码': '913305007490121183', '法定代表人': '杨建芬',
                        '注册资本': '97210', '成立日期': '2003-03-13', '企业地址': '浙江省长兴县煤山镇工业园区',
                        '联系电话': '0572-6029388',
                        '联系邮箱': 'dshbgs@tiannenggroup.com', '注册号': '330500400001780',
                        '组织机构代码': '74901211-8', '参保人数': '709',
                        '行业一级': '制造业', '行业二级': '电气机械和器材制造业', '行业三级': '电池制造',
                        '曾用名': '天能电池集团有限公司,\n浙江天能电池有限公司',
                        '企业简介': '公司简介。',
                        '经营范围': '经营范围'},
         '作用': '查询指定公司的工商注册信息', '备注': '必须是公司名称'},
        {'路由': '/get_sub_company_info', '数据表': 'SubCompanyInfo',
         'API描述': '根据被投资的子公司名称获得投资该公司的上市公司、投资比例、投资金额等信息',
         '输入参数': {'query_conds': {'公司名称': 'str'}, 'need_fields': ['SubCompanyInfo属性值']},
         '参数示例': {'query_conds': {'公司名称': '上海爱斯达克汽车空调系统有限公司'},
                      'need_fields': []},
         '返回值示例': {'关联上市公司全称': '上海航天汽车机电股份有限公司', '上市公司关系': '子公司',
                        '上市公司参股比例': '87.5', '上市公司投资金额': '8.54亿',
                        '公司名称': '上海爱斯达克汽车空调系统有限公司'},
         '作用': '查询特定子公司的投资信息，包括投资上市公司、比例和金额', '备注': '必须是被投资子公司的名称'},
        {'路由': '/get_legal_document', '数据表': 'LegalDoc', 'API描述': '根据案号查询裁判文书相关信息',
         '输入参数': {'query_conds': {'案号': 'str'}, 'need_fields': ['LegalDoc属性值']},
         '参数示例': {'query_conds': {'案号': '(2019)沪0115民初61975号'}, 'need_fields': []},
         '返回值示例': {'关联公司': '上海爱斯达克汽车空调系统有限公司',
                        '标题': '上海爱斯达克汽车空调系统有限公司与上海逸测检测技术服务有限公司服务合同纠纷一审民事判决书',
                        '案号': '(2019)沪0115民初61975号', '文书类型': '民事判决书',
                        '原告': '上海爱斯达克汽车空调系统有限公司', '被告': '上海逸测检测技术服务有限公司',
                        '原告律师事务所': '', '被告律师事务所': '上海世韬律师事务所', '案由': '服务合同纠纷',
                        '涉案金额': '1254802.58',
                        '判决结果': '判决结果xxx',
                        '日期': '2019-12-09 00:00:00', '文件名': '（2019）沪0115民初61975号.txt'},
         '作用': '查询特定案号的裁判文书信息',
         '备注': '必须是案号'},
        {'路由': '/get_court_info', '数据表': 'CourtInfo', 'API描述': '根据法院名称查询CourtInfo表中信息',
         '输入参数': {'query_conds': {'法院名称': 'str'}, 'need_fields': ['CourtInfo属性值']},
         '参数示例': {'query_conds': {'法院名称': '上海市浦东新区人民法院'}, 'need_fields': []},
         '返回值示例': {'法院名称': '上海市浦东新区人民法院', '法院负责人': '朱丹', '成立日期': '2019-05-16',
                        '法院地址': '上海市浦东新区丁香路611号', '法院联系电话': '-', '法院官网': '-'},
         '作用': '查询特定法院的基本信息',
         '备注': '必须是法院名称'},
        {'路由': '/get_lawfirm_info', '数据表': 'LawfirmInfo', 'API描述': '根据律师事务所名称查询LawfirmInfo表信息',
         '输入参数': {'query_conds': {'律师事务所名称': 'str'}, 'need_fields': ['LawfirmInfo属性值']},
         '参数示例': {'query_conds': {'律师事务所名称': '爱德律师事务所'}, 'need_fields': []},
         '返回值示例': {'律师事务所名称': '爱德律师事务所', '律师事务所唯一编码': '31150000E370803331',
                        '律师事务所负责人': '巴布', '事务所注册资本': '10万元人民币',
                        '事务所成立日期': '1995-03-14', '律师事务所地址': '呼和浩特市赛罕区大学西街110号丰业大厦11楼',
                        '通讯电话': '0471-3396155',
                        '通讯邮箱': 'kehufuwubu@ardlaw.cn', '律所登记机关': '内蒙古自治区呼和浩特市司法局'},
         '作用': '查询特定律师事务所的详细信息',
         '备注': '必须是律师事务所名称'},
        {'路由': '/get_temp_info', '数据表': 'TempInfo', 'API描述': '根据日期及省份城市查询天气相关信息',
         '输入参数': {'query_conds': {'省份': 'str', '城市': 'str', '日期': 'str'},
                      'need_fields': ['TempInfo属性值']},
         '参数示例': {'query_conds': {'省份': '北京市', '城市': '北京市', '日期': '2020年1月1日'},
                      'need_fields': []},
         '返回值示例': {'日期': '2020年1月1日', '省份': '北京市', '城市': '北京市', '天气': '晴', '最高温度': '11',
                        '最低温度': '1', '湿度': '55'}, '作用': '查询特定地区特定日期的天气信息',
         '备注': '必须是省份、城市和日期'},
        {'路由': '/get_sub_company_info_list', '数据表': 'SubCompanyInfo',
         'API描述': '根据上市公司（母公司）的名称查询该公司投资的所有子公司信息list',
         '输入参数': {'query_conds': {'关联上市公司全称': 'str'}, 'need_fields': ['SubCompanyInfo属性值']},
         '参数示例': {'query_conds': {'关联上市公司全称': '上海航天汽车机电股份有限公司'}, 'need_fields': []},
         '返回值示例': [
             {'关联上市公司全称': '上海航天汽车机电股份有限公司', '上市公司关系': '子公司', '上市公司参股比例': '100.0',
              '上市公司投资金额': '8800.00万',
              '公司名称': '甘肃神舟光伏电力有限公司'}],
         '作用': '查询指定上市公司的所有子公司信息，查询后的结果可以使用filter_sub_company函数进行过滤，也可以基于 上市公司投资金额 进行排序求和操作',
         '备注': '必须是上市公司全称'},
        {'路由': '/get_legal_document_list', '数据表': 'LegalDoc',
         'API描述': '根据关联公司查询所有裁判文书相关信息list',
         '输入参数': {'query_conds': {'关联公司': 'str'}, 'need_fields': ['LegalDoc属性值']},
         '参数示例': {'query_conds': {'关联公司': '上海爱斯达克汽车空调系统有限公司'}, 'need_fields': []},
         '返回值示例': [
             {'关联公司': '上海爱斯达克汽车空调系统有限公司',
              '标题': '上海爱斯达克汽车空调系统有限公司与上海逸测检测技术服务有限公司服务合同纠纷一审民事判决书',
              '案号': '(2019)沪0115民初61975号', '文书类型': '民事判决书', '原告': '上海爱斯达克汽车空调系统有限公司',
              '被告': '上海逸测检测技术服务有限公司',
              '原告律师事务所': '', '被告律师事务所': '上海世韬律师事务所', '案由': '服务合同纠纷',
              '涉案金额': '1254802.58',
              '判决结果': '一、被告。。。 ',
              '日期': '2019-12-09 00:00:00', '文件名': '（2019）沪0115民初61975号.txt'}],
         '作用': '查询与指定公司相关的所有裁判文书，查询后的结果可以使用filter_legal_docs', '备注': '必须是公司全称'},
        {'路由': '/get_court_code', '数据表': 'CourtCode',
         'API描述': '根据`法院名称`、`法院代字`查询CourtCode相关数据',
         '输入参数': {'query_conds': {'法院名称|法院代字': 'str'}, 'need_fields': ['CourtCode属性值']},
         '参数示例': {'query_conds': {'法院名称': '上海市浦东新区人民法院'}, 'need_fields': []},
         '返回值示例': {'法院名称': '上海市浦东新区人民法院', '行政级别': '市级', '法院级别': '基层法院',
                        '法院代字': '沪0115', '区划代码': '310115', '级别': '1'},
         '作用': '一般是使用法院名称查询，为了获取法院级别，区划代码等信息',
         '备注': '参数为"法院名称" 或 "法院代字",如果是根据案号获取法院请使用 get_court_code_by_case_number 函数'},
        {'路由': '/get_lawfirm_log', '数据表': 'LawfirmLog', 'API描述': '根据律师事务所查询律师事务所统计数据',
         '输入参数': {'query_conds': {'律师事务所名称': 'str'}, 'need_fields': ['LawfirmLog属性值']},
         '参数示例': {'query_conds': {'律师事务所名称': '北京市金杜律师事务所'}, 'need_fields': []},
         '返回值示例': {'律师事务所名称': '北京市金杜律师事务所', '业务量排名': '2', '服务已上市公司': '68',
                        '报告期间所服务上市公司违规事件': '23',
                        '报告期所服务上市公司接受立案调查': '3'}, '作用': '查询特定律师事务所的统计数据',
         '备注': '必须是律师事务所名称'},
        {'路由': '/get_address_info', '数据表': 'AddrInfo', 'API描述': '根据地址查该地址对应的省份城市区县',
         '输入参数': {'query_conds': {'地址': 'str'}, 'need_fields': ['AddrInfo属性值']},
         '参数示例': {'query_conds': {'地址': '西藏自治区那曲地区安多县帕那镇中路13号'}, 'need_fields': []},
         '返回值示例': {'地址': '西藏自治区那曲地区安多县帕那镇中路13号', '省份': '西藏自治区', '城市': '那曲市',
                        '区县': '安多县'},
         '作用': '根据之前查询到的企业地址，律师事务所地址，法院地址等获取详细省市区信息，方便查询天气，区划代码等',
         '备注': '必须是详细地址'},
        {'路由': '/get_address_code', '数据表': 'AddrCode', 'API描述': '根据省市区查询区划代码',
         '输入参数': {'query_conds': {'省份': 'str', '城市': 'str', '区县': 'str'}, 'need_fields': ['AddrCode属性值']},
         '参数示例': {'query_conds': {'省份': '西藏自治区', '城市': '拉萨市', '区县': '城关区'}, 'need_fields': []},
         '返回值示例': {'省份': '西藏自治区', '城市': '拉萨市', '城市区划代码': '540100000000', '区县': '城关区',
                        '区县区划代码': '540102000000'}, '作用': '查询特定省市区的行政区划代码',
         '备注': '必须是省、市、区县名称'},
        {'路由': '/get_legal_abstract', '数据表': 'LegalAbstract', 'API描述': '根据案号查询文本摘要',
         '输入参数': {'query_conds': {'案号': 'str'}, 'need_fields': ['LegalDoc属性值']},
         '参数示例': {'query_conds': {'案号': '（2019）沪0115民初61975号'}, 'need_fields': []},
         '返回值示例': {'文件名': '（2019）沪0115民初61975号.txt', '案号': '（2019）沪0115民初61975号',
                        '文本摘要': '原告上海。。。。'},
         '作用': '查询特定案号的文本摘要信息', '备注': '必须是案号'},
        {'路由': '/get_xzgxf_info', '数据表': 'XzgxfInfo', 'API描述': '根据案号查询限制高消费相关信息',
         '输入参数': {'query_conds': {'案号': 'str'}, 'need_fields': ['XzgxfInfo属性值']},
         '参数示例': {'query_conds': {'案号': '（2018）鲁0403执1281号'}, 'need_fields': []},
         '返回值示例': {'限制高消费企业名称': '枣庄西能新远大天然气利用有限公司', '案号': '（2018）鲁0403执1281号',
                        '法定代表人': '高士其', '申请人': '枣庄市人力资源和社会保障局', '涉案金额': '12000',
                        '执行法院': '山东省枣庄市薛城区人民法院', '立案日期': '2018-11-16 00:00:00',
                        '限高发布日期': '2019-02-13 00:00:00'}
            , '作用': '查询特定案号的限制高消费信息', '备注': '必须是案号'},
        {'路由': '/get_xzgxf_info_list', '数据表': 'XzgxfInfo', 'API描述': '根据企业名称查询所有限制高消费相关信息list',
         '输入参数': {"query_conds": {"限制高消费企业名称": "str"}, "need_fields": ['XzgxfInfo属性值']},
         '参数示例': {"query_conds": {"限制高消费企业名称": "欣水源生态环境科技有限公司"}, "need_fields": []},
         '返回值示例': {'限制高消费企业名称': '欣水源生态环境科技有限公司', '案号': '（2023）黔2731执恢130号',
                        '法定代表人': '刘福云', '申请人': '四川省裕锦建设工程有限公司惠水分公司',
                        '涉案金额': '7500000', '执行法院': '贵州省黔南布依族苗族自治州惠水县人民法院',
                        '立案日期': '2023-08-04 00:00:00', '限高发布日期': '2023-11-09 00:00:00'},
         '作用': '查询与特定企业相关的所有限制高消费信息，查询后的结果可以使用filter_xzgxf_info_list进行过滤，也可以根据涉案金额进行排序求和等操作',
         '备注': '必须是企业名称'},
        {'路由': '/get_sum', '数据表': 'Any',
         'API描述': '求和，可以对传入的int、float、str数组进行求和，str数组只能转换字符串里的千万亿，如"1万"',
         '输入参数': ['int | float | str'], '参数示例': [1, 2, 3, 4, 5], '返回值示例': 15,
         '作用': '对传入的数字或数字字符串进行求和操作', '备注': '数组元素可以是整数、浮点数或数字字符串'},
        {
            "路由": "/rank",
            "数据表": "Any",
            "API描述": "排序接口，返回按照指定键排序的列表，不可统计",
            "输入参数": {
                "data_list": "list",
                "key": "str",
                "is_desc": "bool = False"
            },
            "参数示例": {
                "data_list": [
                    {"涉案金额": '100', "案号": "案号1"},
                    {"涉案金额": 200, "案号": "案号2"},
                    {"涉案金额": 50, "案号": "案号3"}
                ],
                "key": "涉案金额",
                "is_desc": True
            },
            "返回值示例": [
                {"涉案金额": 200, "案号": "案号2"},
                {"涉案金额": 100, "案号": "案号1"},
                {"涉案金额": 50, "案号": "案号3"}
            ]
        }

        ]

WORD_API = [
    {'路由': '/save_dict_list_to_word', '数据表': 'Any',
     'API描述': '通过传入结构化信息，制作生成公司数据报告（demo）',
     '输入参数': {'company_name': 'str', 'dict_list': 'json'},
     '参数示例': {'company_name': '北京碧水源科技股份有限公司', 'dict_list': json.dumps({'工商信息': [
         {'公司名称': '北京碧水源科技股份有限公司', '登记状态': '存续', '统一社会信用代码': '91110000802115985Y',
          '参保人数': '351', '行业一级': '科学研究和技术服务业', '行业二级': '科技推广和应用服务业',
          '行业三级': '其他科技推广服务业'}], '子公司信息': [
         {'关联上市公司全称': '北京碧水源科技股份有限公司', '上市公司关系': '子公司', '上市公司参股比例': 100.0,
          '上市公司投资金额': '1.06亿', '公司名称': '北京碧海环境科技有限公司'}], '裁判文书': [
         {'关联公司': '北京碧水源科技股份有限公司', '原告': '四川帝宇水利水电工程有限公司',
          '被告': '成都碧水源江环保科技有限公司,北京碧水源科技股份有限公司', '案由': '建设工程施工合同纠纷',
          '涉案金额': 0.0, '日期': '2019-07-23 00:00:00'}], '限制高消费': [
         {'限制高消费企业名称': '南京仙林碧水源污水处理有限公司', '案号': '（2024）苏0113执1601号',
          '申请人': '苏华建设集团有限公司', '涉案金额': '-', '立案日期': '2024-04-07 00:00:00',
          '限高发布日期': '2024-06-24 00:00:00'}]}, ensure_ascii=False)},
     '返回值示例': '生成Word文档失败，请检查输入数据是否正确',
     '作用': '生成公司数据报告的Word文档',
     '备注': '需要提供公司名称和结构化信息,结构化信息为json字符串，推荐使用json.dumps(信息,ensure_ascii=False) 其中key为["工商信息","限制高消费","子公司信息","裁判文书"]，如果没有要求可以省略key'},
]

SUE_API = [
    {'路由': '/get_citizens_sue_citizens', '数据表': 'Any', 'API描述': '民事起诉状(公民起诉公民)',
     '输入参数': '详见输入示例',
     '参数示例': {'原告': '张三', '原告性别': '男', '原告生日': '1976-10-2', '原告民族': '汉',
                  '原告工作单位': 'XXX', '原告地址': '中国',
                  '原告联系方式': '123456', '原告委托诉讼代理人': '李四', '原告委托诉讼代理人联系方式': '421313',
                  '被告': '王五', '被告性别': '女',
                  '被告生日': '1975-02-12', '被告民族': '汉', '被告工作单位': 'YYY', '被告地址': '江苏',
                  '被告联系方式': '56354321',
                  '被告委托诉讼代理人': '赵六', '被告委托诉讼代理人联系方式': '09765213', '诉讼请求': 'AA纠纷',
                  '事实和理由': '上诉', '证据': 'PPPPP',
                  '法院名称': '最高法', '起诉日期': '2012-09-08'}, '返回值示例': None, '作用': '生成民事起诉状文档',
     '备注': '详细信息需根据实际情况填写'},
    {'路由': '/get_company_sue_citizens', '数据表': 'Any', 'API描述': '民事起诉状(公司起诉公民)',
     '输入参数': '详见输入示例',
     '参数示例': {'原告': '上海公司', '原告地址': '上海', '原告法定代表人': '张三', '原告联系方式': '872638',
                  '原告委托诉讼代理人': 'B律师事务所', '原告委托诉讼代理人联系方式': '5678900', '被告': '王五',
                  '被告性别': '女', '被告生日': '1975-02-12', '被告民族': '汉', '被告工作单位': 'YYY',
                  '被告地址': '江苏', '被告联系方式': '56354321', '被告委托诉讼代理人': '赵六',
                  '被告委托诉讼代理人联系方式': '09765213', '诉讼请求': 'AA纠纷', '事实和理由': '上诉',
                  '证据': 'PPPPP', '法院名称': '最高法', '起诉日期': '2012-09-08'}, '返回值示例': None,

     '作用': '生成民事起诉状文档',
     '备注': '详细信息需根据实际情况填写'},

    {'路由': '/get_citizens_sue_company', '数据表': 'Any', 'API描述': '民事起诉状(公民起诉公司)',
     '输入参数': '详见输入示例',
     '参数示例': {'原告': '张三', '原告性别': '男', '原告生日': '1976-10-2', '原告民族': '汉', '原告工作单位': 'XXX',
                  '原告地址': '中国', '原告联系方式': '123456', '原告委托诉讼代理人': '李四',
                  '原告委托诉讼代理人联系方式': '421313', '被告': '王五公司', '被告地址': '公司地址',
                  '被告法定代表人': '赵四', '被告联系方式': '98766543', '被告委托诉讼代理人': 'C律师事务所',
                  '被告委托诉讼代理人联系方式': '425673398', '诉讼请求': 'AA纠纷', '事实和理由': '上诉',
                  '证据': 'PPPPP',
                  '法院名称': '最高法', '起诉日期': '2012-09-08'}, '返回值示例': None,

     '作用': '生成民事起诉状文档',
     '备注': '详细信息需根据实际情况填写'},

    {'路由': '/get_company_sue_company', '数据表': 'Any', 'API描述': '民事起诉状(公民起诉公司)',
     '输入参数': '详见输入示例',
     '参数示例': {'原告': '上海公司', '原告地址': '上海', '原告法定代表人': '张三', '原告联系方式': '872638',
                  '原告委托诉讼代理人': 'B律师事务所', '原告委托诉讼代理人联系方式': '5678900', '被告': '王五公司',
                  '被告地址': '公司地址', '被告法定代表人': '赵四', '被告联系方式': '98766543',
                  '被告委托诉讼代理人': 'C律师事务所', '被告委托诉讼代理人联系方式': '425673398',
                  '诉讼请求': 'AA纠纷', '事实和理由': '上诉', '证据': 'PPPPP', '法院名称': '最高法',
                  '起诉日期': '2012-09-08'}, '返回值示例': None,

     '作用': '生成民事起诉状文档',
     '备注': '详细信息需根据实际情况填写'}
]

TABLE_DESC = '\n\n---\n\n'.join([json.dumps(i, indent=1, ensure_ascii=False) for i in TABLES])

API_DESC = '\n\n---\n\n'.join([json.dumps(i, indent=1, ensure_ascii=False) for i in APIS])


APIS2 = [{'路由': '/get_company_info', '数据表': 'CompanyInfo',
          'API描述': '根据上市公司名称、简称或代码查找CompanyInfo表中的上市公司信息,必须是上市公司名称、简称或代码，其中query_conds的key可以是公司名称 公司简称  公司代码',
          '输入参数': {'query_conds': {'公司名称|公司简称|公司代码': 'str'}, 'need_fields': ['CompanyInfo属性值']},
          '参数示例': {'query_conds': {'公司名称': '上海妙可蓝多食品科技股份有限公司'}, 'need_fields': []},
          '返回值': 'Dict[CompanyInfo]'},
         {'路由': '/get_company_register_name', '数据表': 'CompanyRegister',
          'API描述': '根据统一社会信用代码查询公司名称',
          '输入参数': {'query_conds': {'统一社会信用代码': 'str'}, 'need_fields': ['CompanyRegister属性值']},
          '参数示例': {'query_conds': {'统一社会信用代码': '913305007490121183'}, 'need_fields': []},
          '返回值': 'Dict[公司名称]'},
         {'路由': '/get_company_register', '数据表': 'CompanyRegister',
          'API描述': '根据公司名称，查询工商信息，注意/get_company_register接口无法根据统一社会信用代码查询公司名称,输入的公司名称必须是公司全称',
          '输入参数': {'query_conds': {'公司名称': 'str'}, 'need_fields': ['CompanyRegister属性值']},
          '参数示例': {'query_conds': {'公司名称': '天能电池集团股份有限公司'}, 'need_fields': []},
          '返回值': 'Dict[CompanyRegister]'},
         {'路由': '/get_sub_company_info', '数据表': 'SubCompanyInfo',
          'API描述': '根据被投资的子公司名称获得投资该公司的上市公司、投资比例、投资金额等信息，输入的是子公司名称注意区别',
          '输入参数': {'query_conds': {'公司名称': 'str'}, 'need_fields': ['SubCompanyInfo属性值']},
          '参数示例': {'query_conds': {'公司名称': '上海爱斯达克汽车空调系统有限公司'},
                       'need_fields': []},
          '返回值': 'Dict[SubCompanyInfo]'},
         {'路由': '/get_legal_document', '数据表': 'LegalDoc',
          'API描述': '根据案号查询裁判文书相关信息',
          '输入参数': {'query_conds': {'案号': 'str'}, 'need_fields': ['LegalDoc属性值']},
          '参数示例': {'query_conds': {'案号': '(2019)沪0115民初61975号'}, 'need_fields': []},
          '返回值': 'Dict[LegalDoc]'},
         {'路由': '/get_court_info', '数据表': 'CourtInfo', 'API描述': '根据法院名称查询CourtInfo表中信息',
          '输入参数': {'query_conds': {'法院名称': 'str'}, 'need_fields': ['CourtInfo属性值']},
          '参数示例': {'query_conds': {'法院名称': '上海市浦东新区人民法院'}, 'need_fields': []},
          '返回值': 'Dict[CourtInfo]'},
         {'路由': '/get_lawfirm_info', '数据表': 'LawfirmInfo', 'API描述': '根据律师事务所名称查询LawfirmInfo表信息',
          '输入参数': {'query_conds': {'律师事务所名称': 'str'}, 'need_fields': ['LawfirmInfo属性值']},
          '参数示例': {'query_conds': {'律师事务所名称': '爱德律师事务所'}, 'need_fields': []},
          '返回值': 'Dict[LawfirmInfo]'},
         {'路由': '/get_temp_info', '数据表': 'TempInfo',
          'API描述': '根据日期及省份城市查询天气相关信息,三个参数都是必填的',
          '输入参数': {'query_conds': {'省份': 'str', '城市': 'str', '日期': 'str'},
                       'need_fields': ['TempInfo属性值']},
          '参数示例': {'query_conds': {'省份': '北京市', '城市': '北京市', '日期': '2020年1月1日'},
                       'need_fields': []},
          '返回值': 'Dict[TempInfo]'},
         {'路由': '/get_sub_company_info_list', '数据表': 'SubCompanyInfo',
          'API描述': '根据上市公司（母公司）的名称查询该公司投资的所有子公司信息list,如果需要按照条件过滤，可以使用filter_sub_company函数进行过滤，也可以基于 上市公司投资金额 进行排序求和操作',
          '输入参数': {'query_conds': {'关联上市公司全称': 'str'}, 'need_fields': ['SubCompanyInfo属性值']},
          '参数示例': {'query_conds': {'关联上市公司全称': '上海航天汽车机电股份有限公司'}, 'need_fields': []},
          '返回值': 'List[Dict[SubCompanyInfo]]'},
         {'路由': '/get_legal_document_list', '数据表': 'LegalDoc',
          'API描述': '根据关联公司查询所有裁判文书相关信息list,查询后的结果可以使用filter_legal_docs进行过滤，案由采取模糊匹配方法，必须使用公司全称',
          '输入参数': {'query_conds': {'关联公司': 'str'}, 'need_fields': ['LegalDoc属性值']},
          '参数示例': {'query_conds': {'关联公司': '上海爱斯达克汽车空调系统有限公司'}, 'need_fields': []},
          '返回值': 'List[Dict[LegalDoc]]',
          '作用': '查询与指定公司相关的所有裁判文书', '备注': '必须是公司全称'},
         {'路由': '/get_court_code', '数据表': 'CourtCode',
          'API描述': '根据法院名称或者法院代字查询CourtCode相关数据,如果是案号，请使用辅助函数，不要自己从案号里找法院代字，除非题目里有法院代字.其中query_conds的key可以是:法院名称或者法院代字',
          '输入参数': {'query_conds': {'法院名称|法院代字': 'str'}, 'need_fields': ['CourtCode属性值']},
          # '备注':'参数只能是法院名称或法院代字中的一个',
          '参数示例': {'query_conds': {'法院名称': '上海市浦东新区人民法院'}, 'need_fields': []},
          '返回值': 'Dict[CourtCode]'},
         {'路由': '/get_lawfirm_log', '数据表': 'LawfirmLog', 'API描述': '根据律师事务所查询律师事务所统计数据',
          '输入参数': {'query_conds': {'律师事务所名称': 'str'}, 'need_fields': ['LawfirmLog属性值']},
          '参数示例': {'query_conds': {'律师事务所名称': '北京市金杜律师事务所'}, 'need_fields': []},
          '返回值': 'Dict[LawfirmLog]'},
         {'路由': '/get_address_info', '数据表': 'AddrInfo',
          'API描述': '根据地址查该地址对应的省份城市区县,可以根据题目地址或之前查询到的企业地址，律师事务所地址，法院地址等获取详细省市区信息，方便查询天气，区划代码等',
          '输入参数': {'query_conds': {'地址': 'str'}, 'need_fields': ['AddrInfo属性值']},
          '参数示例': {'query_conds': {'地址': '西藏自治区那曲地区安多县帕那镇中路13号'}, 'need_fields': []},
          '返回值': 'Dict[AddrInfo]'},
         {'路由': '/get_address_code', '数据表': 'AddrCode', 'API描述': '根据省市区查询区划代码',
          '输入参数': {'query_conds': {'省份': 'str', '城市': 'str', '区县': 'str'}, 'need_fields': ['AddrCode属性值']},
          '参数示例': {'query_conds': {'省份': '西藏自治区', '城市': '拉萨市', '区县': '城关区'}, 'need_fields': []},
          '返回值': 'Dict[AddrCode]'},
          {'路由': '/get_legal_abstract', '数据表': 'LegalDoc', 'API描述': '根据案号查询文本摘要,用于总结文件内容',
           '输入参数': {'query_conds': {'案号': 'str'}, 'need_fields': ['LegalDoc属性值']},
           '参数示例': {'query_conds': {'案号': '（2019）沪0115民初61975号'}, 'need_fields': []},
           '返回值': 'Dict[LegalDoc]'},
         {'路由': '/get_xzgxf_info', '数据表': 'XzgxfInfo', 'API描述': '根据案号查询限制高消费相关信息',
          '输入参数': {'query_conds': {'案号': 'str'}, 'need_fields': ['XzgxfInfo属性值']},
          '参数示例': {'query_conds': {'案号': '（2018）鲁0403执1281号'}, 'need_fields': []},
          '返回值': 'Dict[XzgxfInfo]'},
         {'路由': '/get_xzgxf_info_list', '数据表': 'XzgxfInfo',
          'API描述': '根据企业名称查询所有限制高消费相关信息list,查询后的结果可以使用filter_xzgxf_info_list进行过滤，也可以根据涉案金额进行排序求和等操作',
          '输入参数': {"query_conds": {"限制高消费企业名称": "str"}, "need_fields": ['XzgxfInfo属性值']},
          '参数示例': {"query_conds": {"限制高消费企业名称": "欣水源生态环境科技有限公司"}, "need_fields": []},
          '返回值': 'List[Dict[XzgxfInfo]]'},
         {'路由': '/get_sum', '数据表': 'Any',
          'API描述': '求和，可以对传入的int、float、str数组进行求和，str数组只能转换字符串里的千万亿，如"1万"',
          '输入参数': ['int | float | str'], '参数示例': [1, 2, 3, 4, 5], '返回值示例': 15,
          '作用': '对传入的数字或数字字符串进行求和操作', '备注': '数组元素可以是整数、浮点数或数字字符串,此函数只能用于求和，不可用于统计。'},
         {
             "路由": "/rank",
             "数据表": "Any",
             "API描述": "排序接口，返回按照指定键排序的列表",
             "输入参数": {
                 "data_list": "list",
                 "key": "str",
                 "is_desc": "bool = False"
             },
             "参数示例": {
                 "data_list": [
                     {"涉案金额": '100', "案号": "案号1"},
                     {"涉案金额": 200, "案号": "案号2"},
                     {"涉案金额": 50, "案号": "案号3"}
                 ],
                 "key": "涉案金额",
                 "is_desc": True
             },
             "返回值示例": [
                 {"涉案金额": 200, "案号": "案号2"},
                 {"涉案金额": 100, "案号": "案号1"},
                 {"涉案金额": 50, "案号": "案号3"}
             ]
         }

         ]

